PX4/PX4-Autopilot/apps/drivers/stm32/tone_alarm/tone_alarm.cpp
#if TONE_ALARM_CHANNEL == 1
# define TONE_CCMR1	(3 << 4)
# define TONE_CCMR2	0
# define TONE_CCER	(1 << 0)
# define TONE_rCCR	rCCR1
#elif TONE_ALARM_CHANNEL == 2
# define TONE_CCMR1	(3 << 12)
# define TONE_CCMR2	0
# define TONE_CCER	(1 << 4)
# define TONE_rCCR	rCCR2
#elif TONE_ALARM_CHANNEL == 3
# define TONE_CCMR1	0
# define TONE_CCMR2	(3 << 4)
# define TONE_CCER	(1 << 8)
# define TONE_rCCR	rCCR3
#elif TONE_ALARM_CHANNEL == 4
# define TONE_CCMR1	0
# define TONE_CCMR2	(3 << 12)
# define TONE_CCER	(1 << 12)
# define TONE_rCCR	rCCR4
#else
# error Must set TONE_ALARM_CHANNEL to a value between 1 and 4 to use this driver.
#endif


/*
 * Timer register accessors
 */
#define REG(_reg)	(*(volatile uint32_t *)(TONE_ALARM_BASE + _reg))

#define rCR1     	REG(STM32_GTIM_CR1_OFFSET)
#define rCR2     	REG(STM32_GTIM_CR2_OFFSET)
#define rSMCR    	REG(STM32_GTIM_SMCR_OFFSET)
#define rDIER    	REG(STM32_GTIM_DIER_OFFSET)
#define rSR      	REG(STM32_GTIM_SR_OFFSET)
#define rEGR     	REG(STM32_GTIM_EGR_OFFSET)
#define rCCMR1   	REG(STM32_GTIM_CCMR1_OFFSET)
#define rCCMR2   	REG(STM32_GTIM_CCMR2_OFFSET)
#define rCCER    	REG(STM32_GTIM_CCER_OFFSET)
#define rCNT     	REG(STM32_GTIM_CNT_OFFSET)
#define rPSC     	REG(STM32_GTIM_PSC_OFFSET)
#define rARR     	REG(STM32_GTIM_ARR_OFFSET)
#define rCCR1    	REG(STM32_GTIM_CCR1_OFFSET)
#define rCCR2    	REG(STM32_GTIM_CCR2_OFFSET)
#define rCCR3    	REG(STM32_GTIM_CCR3_OFFSET)
#define rCCR4    	REG(STM32_GTIM_CCR4_OFFSET)
#define rDCR     	REG(STM32_GTIM_DCR_OFFSET)
#define rDMAR    	REG(STM32_GTIM_DMAR_OFFSET)

class ToneAlarm : public device::CDev
{
public:
	ToneAlarm();
	~ToneAlarm();

	virtual int		init();

	virtual int		ioctl(file *filp, int cmd, unsigned long arg);
	virtual ssize_t		write(file *filp, const char *buffer, size_t len);

private:
	static const unsigned	_tune_max = 1024; // be reasonable about user tunes
	static const char	* const _default_tunes[];
	static const unsigned	_default_ntunes;
	static const uint8_t	_note_tab[];

	const char		*_user_tune;

	const char		*_tune;		// current tune string
	const char		*_next;		// next note in the string

	unsigned		_tempo;
	unsigned		_note_length;
	enum { MODE_NORMAL, MODE_LEGATO, MODE_STACCATO} _note_mode;
	unsigned		_octave;
	unsigned		_silence_length; // if nonzero, silence before next note
	bool			_repeat;	// if true, tune restarts at end

	hrt_call		_note_call;	// HRT callout for note completion

	// Convert a note value in the range C1 to B7 into a divisor for
	// the configured timer's clock.
	//
	unsigned		note_to_divisor(unsigned note);

	// Calculate the duration in microseconds of play and silence for a 
	// note given the current tempo, length and mode and the number of 
	// dots following in the play string.
	//
	unsigned		note_duration(unsigned &silence, unsigned note_length, unsigned dots);

	// Calculate the duration in microseconds of a rest corresponding to
	// a given note length.
	//
	unsigned		rest_duration(unsigned rest_length, unsigned dots);

	// Start playing the note
	//
	void			start_note(unsigned note);

	// Stop playing the current note and make the player 'safe'
	//
	void			stop_note();

	// Start playing the tune
	//
	void			start_tune(const char *tune);

	// Parse the next note out of the string and play it
	//
	void			next_note();

	// Find the next character in the string, discard any whitespace and
	// return the canonical (uppercase) version.
	//
	int			next_char();

	// Extract a number from the string, consuming all the digit characters.
	//
	unsigned		next_number();

	// Consume dot characters from the string, returning the number consumed.
	//
	unsigned		next_dots();

	// hrt_call trampoline for next_note
	//
	static void		next_trampoline(void *arg);

};

// predefined tune array
const char * const ToneAlarm::_default_tunes[] = {
	"MFT240L8 O4aO5dc O4aO5dc O4aO5dc L16dcdcdcdc",		// startup tune
	"MBT200a8a8a8PaaaP",					// ERROR tone
	"MFT200e8a8a",						// NotifyPositive tone
	"MFT200e8e",						// NotifyNeutral tone
	"MFT200e8c8e8c8e8c8",					// NotifyNegative tone
	"MFT90O3C16.C32C16.C32C16.C32G16.E32G16.E32G16.E32C16.C32C16.C32C16.C32G16.E32G16.E32G16.E32C4", // charge!
	"MFT60O3C32O2A32F16F16F32G32A32A+32O3C16C16C16O2A16",	// dixie
	"MFT90O2C16C16C16F8.A8C16C16C16F8.A4P16P8",		// cucuracha
	"MNT150L8O2GGABGBADGGABL4GL8F+",			// yankee
	"MFT200O3C4.O2A4.G4.F4.D8E8F8D4F8C2.O2G4.O3C4.O2A4.F4.D8E8F8G4A8G2P8", // daisy
	"T200O2B4P8B16B16B4P8B16B16B8G+8E8G+8B8G+8B8O3E8"	// william tell
	"O2B8G+8E8G+8B8G+8B8O3E8O2B4P8B16B16B4P8B16"
	"O2B16B4P8B16B16B4P8B16B16B8B16B16B8B8B8B16"
	"O2B16B8B8B8B16B16B8B8B8B16B16B8B8B2B2B8P8"
	"P4P4P8O1B16B16B8B16B16B8B16B16O2E8F+8G+8"
	"O1B16B16B8B16B16O2E8G+16G+16F+8D+8O1B8B16"
	"O1B16B8B16B16B8B16B16O2E8F+8G+8E16G+16B4"
	"O2B16A16G+16F+16E8G+8E8O3B16B16B8B16B16B8"
	"O3B16B16O4E8F+8G+8O3B16B16B8B16B16O4E8G+16"
	"O4G+16F+8D+8O3B8B16B16B8B16B16B8B16B16O4E8"
	"O4F+8G+8E16G+16B4B16A16G+16F+16E8G+8E8O3G+16"
	"O3G+16G+8G+16G+16G+8G+16G+16G+8O4C+8O3G+8"
	"O4C+8O3G+8O4C+8O3G+8F+8E8D+8C+8G+16G+16G+8"
	"O3G+16G+16G+8G+16G+16G+8O4C+8O3G+8O4C+8O3G+8"
	"O4C+8O3B8A+8B8A+8B8G+16G+16G+8G+16G+16G+8"
	"O3G+16G+16G+8O4C+8O3G+8O4C+8O3G+8O4C+8O3G+8"
	"O3F+8E8D+8C+8G+16G+16G+8G+16G+16G+8G+16G+16"
	"O3G+8O4C+8O3G+8O4C+8O3G+8O4C+8O3B8A+8B8O2B16"
	"O2B16B8F+16F+16F+8F+16F+16F+8G+8A8F+4A8G+8"
	"O2E4G+8F+8F+8F+8O3F+16F+16F+8F+16F+16F+8"
	"O3G+8A8F+4A8G+8E4G+8F+8O2B16B16B8O1B16B16"
	"O1B8B16B16B8B16B16O2E8F+8G+8O1B16B16B8B16"
	"O1B16O2E8G+16G+16F+8D+8O1B8B16B16B8B16B16"
	"O1B8B16B16O2E8F+8G+8E16G+16B4B16A16G+16F+16"
	"O2E8G+8E8O3B16B16B8B16B16B8B16B16O4E8F+8"
	"O4G+8O3B16B16B8B16B16O4E8G+16G+16F+8D+8O3B8"
	"O3B16B16B8B16B16B8B16B16O4E8F+8G+8E16G+16"
	"O4B4B16A16G+16F+16E8G+8E8O3E64F64G64A64B64"
	"O4C64D64E8E16E16E8E8G+4.F+8E8D+8E8C+8O3B16"
	"O4C+16O3B16O4C+16O3B16O4C+16D+16E16O3A16"
	"O3B16A16B16A16B16O4C+16D+16O3G+16A16G+16"
	"O3A16G+16A16B16O4C+16O3F+16G+16F+16G+16F+16"
	"O3G+16F+16G+16F+16G+16F+16D+16O2B16O3B16"
	"O4C+16D+16E8D+8E8C+8O3B16O4C+16O3B16O4C+16"
	"O3B16O4C+16D+16E16O3A16B16A16B16A16B16O4C+16"
	"O4D+16O3G+16A16G+16A16G+16A16B16O4C+16O3F+16"
	"O3G+16F+16G+16F+16A16F+16E16E8P8C+4C+16O2C16"
	"O3C+16O2C16O3D+16C+16O2B16A16A16G+16E16C+16"
	"O2C+16C+16C+16C+16E16D+16O1C16G+16G+16G+16"
	"O1G+16G+16G+16O2C+16E16G+16O3C+16C+16C+16"
	"O3C+16C+16O2C16O3C+16O2C16O3D+16C+16O2B16"
	"O2A16A16G+16E16C+16C+16C+16C+16C+16E16D+16"
	"O1C16G+16G+16G+16G+16G+16G+16O2C+16E16G+16"
	"O3C+16E16D+16C+16D+16O2C16G+16G+16G+16O3G+16"
	"O3E16C+16D+16O2C16G+16G+16G+16O3G+16E16C+16"
	"O3D+16O2B16G+16G+16A+16G16D+16D+16G+16G16"
	"O2G+16G16G+16A16G+16F+16E16O1B16A+16B16O2E16"
	"O1B16O2F+16O1B16O2G+16E16D+16E16G+16E16A16"
	"O2F+16B16O3G+16F+16E16D+16F+16E16C+16O2B16"
	"O3C+16O2B16O3C+16D+16E16F+16G+16O2A16B16"
	"O2A16B16O3C+16D+16E16F+16O2G+16A16G+16A16"
	"O2C16O3C+16D+16E16O2F+16G+16F+16G+16F+16"
	"O2G+16F+16G+16F+16G+16F+16D+16O1B16C16O2C+16"
	"O2D+16E16O1B16A+16B16O2E16O1B16O2F+16O1B16"
	"O2G+16E16D+16E16G+16E16A16F+16B16O3G+16F+16"
	"O3E16D+16F+16E16C+16O2B16O3C+16O2B16O3C+16"
	"O3D+16E16F+16G+16O2A16B16A16B16O3C+16D+16"
	"O3E16F+16O2G+16A16G+16A16B16O3C+16D+16E16"
	"O2F+16O3C+16O2C16O3C+16D+16C+16O2A16F+16"
	"O2E16O3E16F+16G+16A16B16O4C+16D+16E8E16E16"
	"O4E8E8G+4.F8E8D+8E8C+8O3B16O4C+16O3B16O4C+16"
	"O3B16O4C+16D+16E16O3A16B16A16B16A16B16O4C+16"
	"O4D+16O3G+16A16G+16A16G+16A16B16O4C+16O3F+16"
	"O3G+16F+16G+16F+16G+16F+16G+16F+16G+16F+16"
	"O3D+16O2B16O3B16O4C+16D+16E8E16E16E8E8G+4."
	"O4F+8E8D+8E8C+8O3B16O4C+16O3B16O4C+16O3B16"
	"O4C+16D+16E16O3A16B16A16B16A16B16O4C+16D+16"
	"O3G+16A16G+16A16G+16A16B16O4C+16O3F+16G+16"
	"O3F+16G+16F+16A16G+16F+16E8O2B8O3E8G+16G+16"
	"O3G+8G+16G+16G+8G+16G+16G+8O4C+8O3G+8O4C+8"
	"O3G+8O4C+8O3G+8F+8E8D+8C+8G+16G+16G+8G+16"
	"O3G+16G+8G+16G+16G+8O4C+8O3G+8O4C+8O3G+8"
	"O4C+8O3B8A+8B8A+8B8G+16G+16G+8G+16G+16G+8"
	"O3G+16G+16G+8O4C+8O3G+8O4C+8O3G+8O4C+8O3G+8"
	"O3F+8E8D+8C+8G+16G+16G+8G+16G+16G+8G+16G+16"
	"O3G+8O4C+8O3G+8O4C+8O3G+8O4C+8O3B8A+8B8A+8"
	"O3B8O2F+16F+16F+8F+16F+16F+8G+8A8F+4A8G+8"
	"O2E4G+8F+8B8O1B8O2F+16F+16F+8F+16F+16F+8"
	"O2G+8A8F+4A8G+8E4G+8F+8B16B16B8O1B16B16B8"
	"O1B16B16B8B16B16O2E8F+8G+8O1B16B16B8B16B16"
	"O2E8G+16G+16F+8D+8O1B8B16B16B8B16B16B8B16"
	"O1B16O2E8F+8G+8E16G+16B4B16A16G+16F+16E8"
	"O1B8O2E8O3B16B16B8B16B16B8B16B16O4E8F+8G+8"
	"O3B16B16B8B16B16O4E8G+16G+16F+8D+8O3B8B16"
	"O3B16B8B16B16B8B16B16O4E8F+8G+8O3E16G+16"
	"O3B4B16A16G+16F+16E16F+16G+16A16G+16A16B16"
	"O4C+16O3B16O4C+16D+16E16D+16E16F+16G+16A16"
	"O3B16O4A16O3B16O4A16O3B16O4A16O3B16O4A16"
	"O3B16O4A16O3B16O4A16O3B16O4A16O3B16E16F+16"
	"O3G+16A16G+16A16B16O4C+16O3B16O4C+16D+16"
	"O4E16D+16E16F+16G+16A16O3B16O4A16O3B16O4A16"
	"O3B16O4A16O3B16O4A16O3B16O4A16O3B16O4A16"
	"O3B16O4A16O3B16P16G+16O4G+16O3G+16P16D+16"
	"O4D+16O3D+16P16E16O4E16O3E16P16A16O4A16O3A16"
	"P16O3G+16O4G+16O3G+16P16D+16O4D+16O3D+16"
	"P16O3E16O4E16O3E16P16A16O4A16O3A16O4G16O3G16"
	"O4G16O3G16O4G16O3G16O4G16O3G16O4G8E8C8E8"
	"O4G+16O3G+16O4G+16O3G+16O4G+16O3G+16O4G+16"
	"O3G+16O4G+8E8O3B8O4E8G+16O3G+16O4G+16O3G+16"
	"O4G+16O3G+16O4G+16O3G+16O4G+8F8C+8F8A+16"
	"O3A+16O4A+16O3A+16O4A+16O3A+16O4A+16O3A+16"
	"O4A+8G8E8G8B8P16A+16P16A16P16G+16P16F+16"
	"P16O4E16P16D+16P16C+16P16O3B16P16A+16P16"
	"O3A16P16G+16P16F+16P16E16P16D+16P16F+16E16"
	"O3F+16G+16A16G+16A16B16O4C+16O3B16O4C+16"
	"O4D+16E16D+16E16F+16G+16A16O3B16O4A16O3B16"
	"O4A16O3B16O4A16O3B16O4A16O3B16O4A16O3B16"
	"O4A16O3B16O4A16O3B16E16F+16G+16A16G+16A16"
	"O3B16O4C+16O3B16O4C+16D+16E16D+16E16F+16"
	"O4G+16A16O3B16O4A16O3B16O4A16O3B16O4A16O3B16"
	"O4A16O3B16O4A16O3B16O4A16O3B16O4A16O3B16"
	"P16O3G+16O4G+16O3G+16P16D+16O4D+16O3D+16"
	"P16O3E16O4E16O3E16P16A16O4A16O3A16P16G+16"
	"O4G+16O3G+16P16D+16O4D+16O3D+16P16E16O4E16"
	"O3E16P16A16O4A16O3A16O4G16O3G16O4G16O3G16"
	"O4G16O3G16O4G16O3G16O4G8E8C8E8G+16O3G+16"
	"O4G+16O3G+16O4G+16O3G+16O4G+16O3G+16O4G+8"
	"O4E8O3B8O4E8G+16O3G+16O4G+16O3G+16O4G+16"
	"O3G+16O4G+16O3G+16O4G+8F8C+8F8A+16O3A+16"
	"O4A+16O3A+16O4A+16O3A+16O4A+16O3A+16O4A+8"
	"O4G8E8G8B8P16A+16P16A16P16G+16P16F+16P16"
	"O4E16P16D+16P16C+16P16O3B16P16A+16P16A16"
	"P16O3G+16P16F+16P16E16P16D+16P16F16E16D+16"
	"O3E16D+16E8B16B16B8B16B16B8B16B16O4E8F+8"
	"O4G+8O3B16B16B8B16B16B8B16B16O4G+8A8B8P8"
	"O4E8F+8G+8P8O3G+8A8B8P8P2O2B16C16O3C+16D16"
	"O3D+16E16F16F+16G16G+16A16A+16B16C16O4C+16"
	"O4D+16E16D+16F+16D+16E16D+16F+16D+16E16D+16"
	"O4F+16D+16E16D+16F+16D+16E16D+16F+16D+16"
	"O4E16D+16F+16D+16E16D+16F+16D+16E16D+16F+16"
	"O4D+16E8E16O3E16O4E16O3E16O4E16O3E16O4E8"
	"O3B16O2B16O3B16O2B16O3B16O2B16O3B8G+16O2G+16"
	"O3G+16O2G+16O3G+16O2G+16O3G8E16O2E16O3E16"
	"O2E16O3E16O2E16O3E8E16E16E8E8E8O2B16B16B8"
	"O2B8B8G+16G+16G+8G+8G+8E16E16E8E8E8O1B8O2E8"
	"O1B8O2G+8E8B8G+8O3E8O2B8O3E8O2B8O3G+8E8B8"
	"O3G+8O4E4P8E16E16E8E8E8E8E4P8E16E4P8O2E16"
	"O2E2P64",
};

const unsigned ToneAlarm::_default_ntunes = sizeof(_default_tunes) / sizeof(_default_tunes[0]);

// semitone offsets from C for the characters 'A'-'G'
const uint8_t ToneAlarm::_note_tab[] = {9, 11, 0, 2, 4, 5, 7};

